app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "xyz"]]
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
  def director
    id = params[:id]
    @movies = Movie.get_all_movies_by_director(id)
    if (@movies.length == 0)
      title = Movie.find(params[:id]).title